{
  "user": [
    {
      "username": "andreas",
      "email": "andreas@email.com",
      "password": "1234",
      "admin": "true",
      "id": 1
    },
    {
      "username": "kostas",
      "email": "kostas@email.com",
      "password": "1234",
      "admin": "false",
      "id": 2
    },
    {
      "username": "maria",
      "email": "maria@email.com",
      "password": "1234",
      "admin": "false",
      "id": 3
    },
    {
      "username": "giorgos",
      "email": "giorgos@email.com",
      "password": "1234",
      "admin": "false",
      "id": 4
    },
    {
      "username": "eleni",
      "email": "eleni@email.com",
      "password": "1234",
      "admin": "false",
      "id": 5
    },
    {
      "username": "vasilis",
      "email": "vasilis@email.com",
      "password": "1234",
      "admin": "false",
      "id": 6
    }
  ],
  "posts": [
    {
      "id": 1,
      "user": "andreas",
      "title": "To James Webb μας στέλνει την βαθύτερη εικόνα από το διάστημα",
      "date": "4/8/2022",
      "votes": "126",
      "content": "Το διαστημικό τηλεσκόπιο James Webb της NASA κατέγραψε την πιο μακρινή και ευκρινέστερη υπέρυθρη εικόνα του σύμπαντος μέχρι σήμερα. \n\nΗ έγχρωμη εικόνα του σμήνος γαλαξιών SMACS 0723 εντυπωσιάζει με τις λεπτομέρειες που περιλαμβάνει. Σ' αυτή χιλιάδες γαλαξίες - συμπεριλαμβανομένων των πιο αμυδρών αντικειμένων που έχουν παρατηρηθεί ποτέ στο υπέρυθρο του φάσματος- έχουν εμφανιστεί στην θέα του Webb για πρώτη φορά. «Kύριε πρόεδρε, αν ακουμπούσατε έναν κόκκο άμμου στην άκρη του προτεταμένου σας χεριού, αυτό είναι το μέρος του Σύμπαντος που βλέπετε, ένα ψήγμα του\", ανέφερε ενδεικτικά ο επικεφαλής της NASA, Bill Nelson. στον Πρόεδρο των ΗΠΑ, κατά τη διάρκεια της ενημέρωσης.\n\nTο βαθύ πεδίο, που καταγράφηκε από την κάμερα εγγύς υπέρυθρης ακτινοβολίας (NIRCam) του Webb, είναι μια σύνθετη διαδικασία που αποτελείται από εικόνες σε διαφορετικά μήκη κύματος, συνολικού μήκους 12,5 ωρών – επιτυγχάνοντας βάθη σε υπέρυθρα μήκη κύματος πέρα από τα βαθύτερα πεδία που έχει φτάσει το διαστημικό τηλεσκόπιο Hubble, μια διαδικασία που χρειάστηκε εβδομάδες."
    },
    {
      "id": 2,
      "user": "eleni",
      "title": "iPhone 14 Pro και iPhone Pro Max με 48MP κύρια κάμερα και «έξυπνο» notch",
      "date": "5/8/2022",
      "votes": "12",
      "content": "Στο πλαίσιο του σημερινού Apple Far Out Event που ολοκληρώθηκε πριν λίγο, η Apple αποκάλυψε τα iPhone 14 Pro και iPhone 14 Pro Max.\n\nΤα μοντέλα της σειράς Pro απολαμβάνουν αρκετές αναβαθμίσεις συγκριτικά με τα iPhone 14 και iPhone 14 Plus, πόσω μάλλον με τους προκατόχους τους.\n\nΓια αρχή, εξοπλίζονται με τρεις κάμερες που εκμεταλλεύονται πλήρως το νέο λειτουργικό σύστημα, το νέο τσιπ αλλά και το ανανεωμένο hardware. Για την ακρίβεια, ο βασικός αισθητήρας των 48MP (quad-pixel, f/1.78, 24mm focal length) είναι κατά 65% μεγαλύτερος από του iPhone 13 Pro. Αντίστοιχα, ο αισθητήρας ultra-wide (f/2.2, 13mm focal length) αποδίδει καλύτερα."
    },
    {
      "id": 3,
      "user": "giannis",
      "title": "Ο επικεφαλής αρχιτεκτονικής του PlayStation, Masayasu Ito, αποσύρεται μετά από 36 χρόνια",
      "date": "6/8/2022",
      "votes": "12",
      "content": "Η Sony Interactive Entertainment- το τμήμα της εταιρείας που είναι υπεύθυνο για τις κονσόλες και τα αξεσουάρ παιχνιδιών του PlayStation χάνει έναν από τους κύριους αρχιτέκτονές της. \n\nΗ εταιρεία επιβεβαίωσε στο Bloomberg News ότι ο Masayasu Ito, ο οποίος ηγήθηκε της ανάπτυξης του PlayStation 4 και του PlayStation 5, αποχωρεί από το ρόλο του την 1η Οκτωβρίου. Ο Ito εργάζεται στη Sony εδώ και 36 χρόνια, ενώ εντάχθηκε στην εταιρεία το 1986 και ξεκίνησε με την ανάπτυξη του ηχητικού εξοπλισμού αυτοκινήτων τα πρώτα χρόνια παρουσίας του στην εταιρεία. \n\nΜετακινήθηκε στο τμήμα κονσολών το 2000 και έκτοτε συνέβαλε στην ανάπτυξη των παιχνιδοκονσολών PlayStation της Sony, όπως το PS Portable και το PS4 Pro. Στη συνέχεια  έγινε εκτελεστικός αντιπρόεδρος του τμήματος Hardware Engineering and Operation και διευθυντής της Sony Interactive Entertainment. Αν και η Sony δεν ανέλυσε τους λόγους της αποχώρησης του Ito, επιβεβαίωσε στο Bloomberg ότι το 60χρονο στέλεχος αποχωρεί. Θα διατηρήσει την εργασία του σε \"ρόλους που σχετίζονται με το mobility gaming\" εντός του ευρύτερου ομίλου Sony- θα είναι επίσης σύμβουλος της SIE για τους επόμενους 18 μήνες."
    },
    {
      "id": 4,
      "user": "andreas",
      "title": "Οι φιλικές προς το περιβάλλον οδηγίες πλοήγησης των Google Maps έρχονται σε 40 ευρωπαϊκές χώρες",
      "date": "9/8/2022",
      "votes": 15,
      "content": "Η Google επεκτείνει τη φιλική προς το περιβάλλον λειτουργία πλοήγησης των Χαρτών της, επεκτείνοντας τη λειτουργία σε δεκάδες ευρωπαϊκές χώρες και κάνοντάς την ακόμη πιο ισχυρή, επιτρέποντάς σας να επιλέξετε τον τύπο καυσίμου με τον οποίο λειτουργεί το αυτοκίνητό σας.\n\nΗ λειτουργία, που ξεκίνησε αρχικά στις ΗΠΑ και τον Καναδά πέρυσι, πλέον επισημαίνει τις διαδρομές που χρησιμοποιούν λιγότερη ενέργεια, εάν έχουν παρόμοιο χρόνο άφιξης με άλλες εναλλακτικές διαδρομές. Η Google αναφέρει ότι από σήμερα, η λειτουργία επεκτείνεται στους χρήστες σε σχεδόν 40 ευρωπαϊκές χώρες, συμπεριλαμβανομένης της Γαλλίας, της Ιρλανδίας, της Πολωνίας, της Ισπανίας και του Ηνωμένου Βασιλείου. Αν και δεν βρήκαμε τη σχετική λίστα, η λειτουργία δεν εμφανίζεται για την ώρα στους Έλληνες χρήστες της εφαρμογής κάτι που μπορεί να γίνει αργότερα."
    }
  ]
}